# 10 minutes to pandas

In [1]:
import numpy as np
import pandas as pd

## Object creation

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [48]:
dates[1], type(dates[1])

(Timestamp('2013-01-02 00:00:00', freq='D'),
 pandas._libs.tslibs.timestamps.Timestamp)

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01 -0.902337 -0.309755 -0.866344 -0.518865
2013-01-02 -1.427703  0.471819  1.200573 -1.864923
2013-01-03 -1.015876  0.498289 -0.335159  0.930904
2013-01-04  0.231465 -0.181714 -0.276037  0.261959
2013-01-05  0.511472 -0.368564  0.114533 -0.694980
2013-01-06 -1.780081 -0.559910 -0.394964 -0.063189

In [8]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing data

In [12]:
df.head()

                   A         B         C         D
2013-01-01 -0.902337 -0.309755 -0.866344 -0.518865
2013-01-02 -1.427703  0.471819  1.200573 -1.864923
2013-01-03 -1.015876  0.498289 -0.335159  0.930904
2013-01-04  0.231465 -0.181714 -0.276037  0.261959
2013-01-05  0.511472 -0.368564  0.114533 -0.694980

In [13]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.231465 -0.181714 -0.276037  0.261959
2013-01-05  0.511472 -0.368564  0.114533 -0.694980
2013-01-06 -1.780081 -0.559910 -0.394964 -0.063189

In [14]:
df.to_numpy()

array([[-0.90233714, -0.30975454, -0.86634431, -0.51886497],
       [-1.42770286,  0.47181883,  1.20057348, -1.86492347],
       [-1.01587562,  0.49828929, -0.33515879,  0.93090419],
       [ 0.23146478, -0.18171395, -0.2760372 ,  0.26195943],
       [ 0.51147217, -0.36856405,  0.11453273, -0.69498013],
       [-1.78008147, -0.55990993, -0.39496417, -0.06318926]])

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.730510 -0.074972 -0.092900 -0.324849
std    0.912858  0.450663  0.706794  0.952491
min   -1.780081 -0.559910 -0.866344 -1.864923
25%   -1.324746 -0.353862 -0.380013 -0.650951
50%   -0.959106 -0.245734 -0.305598 -0.291027
75%   -0.051986  0.308436  0.016890  0.180672
max    0.511472  0.498289  1.200573  0.930904

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.902337   -1.427703   -1.015876    0.231465    0.511472   -1.780081
B   -0.309755    0.471819    0.498289   -0.181714   -0.368564   -0.559910
C   -0.866344    1.200573   -0.335159   -0.276037    0.114533   -0.394964
D   -0.518865   -1.864923    0.930904    0.261959   -0.694980   -0.063189

In [27]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.518865 -0.866344 -0.309755 -0.902337
2013-01-02 -1.864923  1.200573  0.471819 -1.427703
2013-01-03  0.930904 -0.335159  0.498289 -1.015876
2013-01-04  0.261959 -0.276037 -0.181714  0.231465
2013-01-05 -0.694980  0.114533 -0.368564  0.511472
2013-01-06 -0.063189 -0.394964 -0.559910 -1.780081

In [30]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06 -1.780081 -0.559910 -0.394964 -0.063189
2013-01-05  0.511472 -0.368564  0.114533 -0.694980
2013-01-01 -0.902337 -0.309755 -0.866344 -0.518865
2013-01-04  0.231465 -0.181714 -0.276037  0.261959
2013-01-02 -1.427703  0.471819  1.200573 -1.864923
2013-01-03 -1.015876  0.498289 -0.335159  0.930904

## Selection

In [31]:
df['A']

2013-01-01   -0.902337
2013-01-02   -1.427703
2013-01-03   -1.015876
2013-01-04    0.231465
2013-01-05    0.511472
2013-01-06   -1.780081
Freq: D, Name: A, dtype: float64

In [35]:
df['B']

2013-01-01   -0.309755
2013-01-02    0.471819
2013-01-03    0.498289
2013-01-04   -0.181714
2013-01-05   -0.368564
2013-01-06   -0.559910
Freq: D, Name: B, dtype: float64

In [32]:
type(df.T['2013-01-01'])

pandas.core.series.Series

In [33]:
type(df['A'])

pandas.core.series.Series

In [34]:
# df.T.2013-01-01 # error

In [36]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.902337 -0.309755 -0.866344 -0.518865
2013-01-02 -1.427703  0.471819  1.200573 -1.864923
2013-01-03 -1.015876  0.498289 -0.335159  0.930904

In [37]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.427703  0.471819  1.200573 -1.864923
2013-01-03 -1.015876  0.498289 -0.335159  0.930904
2013-01-04  0.231465 -0.181714 -0.276037  0.261959

## Selection by label

In [38]:
df.loc[dates[0]]

A   -0.902337
B   -0.309755
C   -0.866344
D   -0.518865
Name: 2013-01-01 00:00:00, dtype: float64

In [39]:
type(df.loc[dates[0]])

pandas.core.series.Series

In [40]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -0.902337 -0.309755
2013-01-02 -1.427703  0.471819
2013-01-03 -1.015876  0.498289
2013-01-04  0.231465 -0.181714
2013-01-05  0.511472 -0.368564
2013-01-06 -1.780081 -0.559910

In [46]:
df.loc[dates[1], ['A', 'B']]

A   -1.427703
B    0.471819
Name: 2013-01-02 00:00:00, dtype: float64

In [59]:
df.loc[dates[1]:dates[3], 'A':'C']

                   A         B         C
2013-01-02 -1.427703  0.471819  1.200573
2013-01-03 -1.015876  0.498289 -0.335159
2013-01-04  0.231465 -0.181714 -0.276037

In [51]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -1.427703  0.471819
2013-01-03 -1.015876  0.498289
2013-01-04  0.231465 -0.181714

In [52]:
df.loc[dates[0], 'A']

-0.9023371424719975

In [53]:
df.at[dates[0], 'A']

-0.9023371424719975

## Selection by position

In [55]:
df

                   A         B         C         D
2013-01-01 -0.902337 -0.309755 -0.866344 -0.518865
2013-01-02 -1.427703  0.471819  1.200573 -1.864923
2013-01-03 -1.015876  0.498289 -0.335159  0.930904
2013-01-04  0.231465 -0.181714 -0.276037  0.261959
2013-01-05  0.511472 -0.368564  0.114533 -0.694980
2013-01-06 -1.780081 -0.559910 -0.394964 -0.063189

In [54]:
df.iloc[3]

A    0.231465
B   -0.181714
C   -0.276037
D    0.261959
Name: 2013-01-04 00:00:00, dtype: float64

In [60]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.231465 -0.181714
2013-01-05  0.511472 -0.368564

In [61]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -1.427703  1.200573
2013-01-03 -1.015876 -0.335159
2013-01-05  0.511472  0.114533

In [62]:
df.iloc[1, 1]

0.47181882591789315

In [66]:
df.loc[dates[1], 'B']

0.47181882591789315

In [63]:
df.iat[1, 1]

0.47181882591789315

## Boolean indexing

In [68]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-04  0.231465 -0.181714 -0.276037  0.261959
2013-01-05  0.511472 -0.368564  0.114533 -0.694980

In [69]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN  0.471819  1.200573       NaN
2013-01-03       NaN  0.498289       NaN  0.930904
2013-01-04  0.231465       NaN       NaN  0.261959
2013-01-05  0.511472       NaN  0.114533       NaN
2013-01-06       NaN       NaN       NaN       NaN

In [71]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -0.902337 -0.309755 -0.866344 -0.518865    one
2013-01-02 -1.427703  0.471819  1.200573 -1.864923    one
2013-01-03 -1.015876  0.498289 -0.335159  0.930904    two
2013-01-04  0.231465 -0.181714 -0.276037  0.261959  three
2013-01-05  0.511472 -0.368564  0.114533 -0.694980   four
2013-01-06 -1.780081 -0.559910 -0.394964 -0.063189  three

In [72]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -1.015876  0.498289 -0.335159  0.930904   two
2013-01-05  0.511472 -0.368564  0.114533 -0.694980  four

## Setting

In [73]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [74]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [75]:
df['F'] = s1

In [76]:
df.at[dates[0], 'A'] = 0

In [80]:
df.iat[0, 2] = 3

In [78]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [81]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  3.000000  5  NaN
2013-01-02 -1.427703  0.471819  1.200573  5  1.0
2013-01-03 -1.015876  0.498289 -0.335159  5  2.0
2013-01-04  0.231465 -0.181714 -0.276037  5  3.0
2013-01-05  0.511472 -0.368564  0.114533  5  4.0
2013-01-06 -1.780081 -0.559910 -0.394964  5  5.0

In [82]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -3.000000 -5  NaN
2013-01-02 -1.427703 -0.471819 -1.200573 -5 -1.0
2013-01-03 -1.015876 -0.498289 -0.335159 -5 -2.0
2013-01-04 -0.231465 -0.181714 -0.276037 -5 -3.0
2013-01-05 -0.511472 -0.368564 -0.114533 -5 -4.0
2013-01-06 -1.780081 -0.559910 -0.394964 -5 -5.0

## Missing data

In [83]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [84]:
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000  3.000000  5  NaN NaN
2013-01-02 -1.427703  0.471819  1.200573  5  1.0 NaN
2013-01-03 -1.015876  0.498289 -0.335159  5  2.0 NaN
2013-01-04  0.231465 -0.181714 -0.276037  5  3.0 NaN

In [86]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [91]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  3.000000  5  NaN  1.0
2013-01-02 -1.427703  0.471819  1.200573  5  1.0  1.0
2013-01-03 -1.015876  0.498289 -0.335159  5  2.0  NaN
2013-01-04  0.231465 -0.181714 -0.276037  5  3.0  NaN

In [87]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -1.427703  0.471819  1.200573  5  1.0  1.0

In [88]:
df1.dropna()

                   A         B         C  D    F    E
2013-01-02 -1.427703  0.471819  1.200573  5  1.0  1.0

In [89]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  3.000000  5  5.0  1.0
2013-01-02 -1.427703  0.471819  1.200573  5  1.0  1.0
2013-01-03 -1.015876  0.498289 -0.335159  5  2.0  5.0
2013-01-04  0.231465 -0.181714 -0.276037  5  3.0  5.0

In [90]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operations

### Stats

In [92]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  3.000000  5  NaN
2013-01-02 -1.427703  0.471819  1.200573  5  1.0
2013-01-03 -1.015876  0.498289 -0.335159  5  2.0
2013-01-04  0.231465 -0.181714 -0.276037  5  3.0
2013-01-05  0.511472 -0.368564  0.114533  5  4.0
2013-01-06 -1.780081 -0.559910 -0.394964  5  5.0

In [93]:
df.mean()

A   -0.580120
B   -0.023347
C    0.551491
D    5.000000
F    3.000000
dtype: float64

In [94]:
df.mean(1)

2013-01-01    2.000000
2013-01-02    1.248938
2013-01-03    1.229451
2013-01-04    1.554743
2013-01-05    1.851488
2013-01-06    1.453009
Freq: D, dtype: float64

In [95]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [96]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [98]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  3.000000  5  NaN
2013-01-02 -1.427703  0.471819  1.200573  5  1.0
2013-01-03 -1.015876  0.498289 -0.335159  5  2.0
2013-01-04  0.231465 -0.181714 -0.276037  5  3.0
2013-01-05  0.511472 -0.368564  0.114533  5  4.0
2013-01-06 -1.780081 -0.559910 -0.394964  5  5.0

In [97]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.015876 -0.501711 -1.335159  4.0  1.0
2013-01-04 -2.768535 -3.181714 -3.276037  2.0  0.0
2013-01-05 -4.488528 -5.368564 -4.885467  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

### Apply

In [101]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  3.000000  5  NaN
2013-01-02 -1.427703  0.471819  1.200573  5  1.0
2013-01-03 -1.015876  0.498289 -0.335159  5  2.0
2013-01-04  0.231465 -0.181714 -0.276037  5  3.0
2013-01-05  0.511472 -0.368564  0.114533  5  4.0
2013-01-06 -1.780081 -0.559910 -0.394964  5  5.0

In [102]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  3.000000   5   NaN
2013-01-02 -1.427703  0.471819  4.200573  10   1.0
2013-01-03 -2.443578  0.970108  3.865415  15   3.0
2013-01-04 -2.212114  0.788394  3.589377  20   6.0
2013-01-05 -1.700642  0.419830  3.703910  25  10.0
2013-01-06 -3.480723 -0.140080  3.308946  30  15.0

In [104]:
df.apply(np.cumsum, axis=1)

                   A         B         C         D         F
2013-01-01  0.000000  0.000000  3.000000  8.000000       NaN
2013-01-02 -1.427703 -0.955884  0.244689  5.244689  6.244689
2013-01-03 -1.015876 -0.517586 -0.852745  4.147255  6.147255
2013-01-04  0.231465  0.049751 -0.226286  4.773714  7.773714
2013-01-05  0.511472  0.142908  0.257441  5.257441  9.257441
2013-01-06 -1.780081 -2.339991 -2.734956  2.265044  7.265044

In [103]:
df.apply(lambda x: x.max() - x.min())

A    2.291554
B    1.058199
C    3.394964
D    0.000000
F    4.000000
dtype: float64

In [105]:
df.apply(lambda x: x.max() - x.min(), axis = 1)

2013-01-01    5.000000
2013-01-02    6.427703
2013-01-03    6.015876
2013-01-04    5.276037
2013-01-05    5.368564
2013-01-06    6.780081
Freq: D, dtype: float64

In [129]:
df.apply(np.max)

A        foo
B        two
C    1.24059
D    1.58838
dtype: object

### Histogramming

In [106]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [107]:
s

0    5
1    2
2    2
3    3
4    5
5    6
6    2
7    1
8    0
9    0
dtype: int64

In [108]:
s.value_counts()

2    3
5    2
0    2
6    1
3    1
1    1
dtype: int64

### String Methods

In [111]:
s1 = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s1

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [112]:
s1.str

In [113]:
s1.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [116]:
# s.str # error

## Merge

### Concat

In [117]:
df = pd.DataFrame(np.random.randn(10, 4))

In [118]:
df

          0         1         2         3
0  1.137571  0.681956  0.115541  1.288358
1  0.203824  0.753559  0.469360 -0.544726
2  0.549527  0.675287 -0.485101 -0.000800
3 -0.435118 -0.513599  1.293310 -0.719748
4  0.330963 -1.232000 -0.134233 -0.236233
5 -0.349174 -0.272339 -0.525821 -0.091578
6  0.084617 -0.127630 -0.119427 -0.735091
7  2.086417 -0.349799 -0.091434  1.075798
8  0.254802 -0.151780  1.312036  0.025871
9 -0.662392  1.410651  0.396425 -0.778701

In [119]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  1.137571  0.681956  0.115541  1.288358
 1  0.203824  0.753559  0.469360 -0.544726
 2  0.549527  0.675287 -0.485101 -0.000800,
           0         1         2         3
 3 -0.435118 -0.513599  1.293310 -0.719748
 4  0.330963 -1.232000 -0.134233 -0.236233
 5 -0.349174 -0.272339 -0.525821 -0.091578
 6  0.084617 -0.127630 -0.119427 -0.735091,
           0         1         2         3
 7  2.086417 -0.349799 -0.091434  1.075798
 8  0.254802 -0.151780  1.312036  0.025871
 9 -0.662392  1.410651  0.396425 -0.778701]

In [121]:
pd.concat(pieces)

          0         1         2         3
0  1.137571  0.681956  0.115541  1.288358
1  0.203824  0.753559  0.469360 -0.544726
2  0.549527  0.675287 -0.485101 -0.000800
3 -0.435118 -0.513599  1.293310 -0.719748
4  0.330963 -1.232000 -0.134233 -0.236233
5 -0.349174 -0.272339 -0.525821 -0.091578
6  0.084617 -0.127630 -0.119427 -0.735091
7  2.086417 -0.349799 -0.091434  1.075798
8  0.254802 -0.151780  1.312036  0.025871
9 -0.662392  1.410651  0.396425 -0.778701

### Join

#### 1

In [122]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [123]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [124]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

#### 2

In [125]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [126]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  bar     5

In [127]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

#### 3

In [14]:
left = pd.DataFrame({'key': ['foo', 'bar', 'bar'], 'lval': [1, 2, 3]})
left

   key  lval
0  foo     1
1  bar     2
2  bar     3

In [19]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  bar     5

In [20]:
pd.merge(left, right)

   key  lval  rval
0  foo     1     4
1  bar     2     5
2  bar     3     5

## Grouping

In [2]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                         'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})

df

     A      B         C         D
0  foo    one  0.259050 -0.117804
1  bar    one  0.180728  0.163346
2  foo    two -0.940620  0.484828
3  bar  three -1.636380 -1.393966
4  foo    two -0.042546 -0.968743
5  bar    two -0.489219  0.256444
6  foo    one  0.698910  0.512126
7  foo  three -1.067153 -0.682060

In [10]:
df.groupby(['A']).transform(np.min)

     B         C         D
0  one -1.067153 -0.968743
1  one -1.636380 -1.393966
2  one -1.067153 -0.968743
3  one -1.636380 -1.393966
4  one -1.067153 -0.968743
5  one -1.636380 -1.393966
6  one -1.067153 -0.968743
7  one -1.067153 -0.968743

In [9]:
df.groupby(['A'])['C'].transform(np.min)

0   -1.067153
1   -1.636380
2   -1.067153
3   -1.636380
4   -1.067153
5   -1.636380
6   -1.067153
7   -1.067153
Name: C, dtype: float64

In [7]:
df.groupby('A')['C'].sum()

A
bar   -1.944871
foo   -1.092359
Name: C, dtype: float64

In [3]:
df.groupby('A').sum()

            C         D
A
bar -0.271149  3.456377
foo -0.791349 -0.391486

In [4]:
df.groupby('A')['B'].describe()

    count unique  top freq
A
bar     3      3  two    1
foo     5      3  two    2

In [5]:
df.groupby('A')['C'].describe()

,count,mean,std,min,25%,50%,75%,max
A,,,,,,,,
bar,3.0,-0.090383,0.577648,-0.721767,-0.341359,0.039049,0.225309,0.411569
foo,5.0,-0.158270,0.386004,-0.425983,-0.361565,-0.289367,-0.234409,0.519975

In [6]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -0.721767  1.145493
    three  0.039049  1.373026
    two    0.411569  0.937857
foo one   -0.595974 -0.137150
    three -0.289367  0.163284
    two    0.093992 -0.417620

In [9]:
df.groupby(['A', 'B']).transform(np.min)

          C         D
0 -0.361565 -0.986537
1 -0.721767  1.145493
2 -0.425983 -1.784855
3  0.039049  1.373026
4 -0.425983 -1.784855
5  0.411569  0.937857
6 -0.361565 -0.986537
7 -0.289367  0.163284

In [8]:
df.groupby(['A', 'B']).min()

                  C         D
A   B
bar one   -0.721767  1.145493
    three  0.039049  1.373026
    two    0.411569  0.937857
foo one   -0.361565 -0.986537
    three -0.289367  0.163284
    two   -0.425983 -1.784855

In [7]:
pd.crosstab(df['B'], df['A'])

A      bar  foo
B
one      1    2
three    1    1
two      1    2

## Reshaping

In [136]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))

In [137]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [138]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [139]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [140]:
df

                     A         B
first second
bar   one    -0.343059 -0.425564
      two     1.079171  1.228279
baz   one     0.320055 -1.350161
      two     1.732219  2.065297
foo   one    -0.939690 -1.029314
      two    -0.155692  0.060817
qux   one    -1.875944  0.564326
      two    -0.207087 -0.043421

In [141]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -0.343059 -0.425564
      two     1.079171  1.228279
baz   one     0.320055 -1.350161
      two     1.732219  2.065297

In [146]:
df[1:2]

                     A         B
first second
bar   two     1.079171  1.228279

In [147]:
stacked = df2.stack()

In [148]:
stacked

first  second
bar    one     A   -0.343059
               B   -0.425564
       two     A    1.079171
               B    1.228279
baz    one     A    0.320055
               B   -1.350161
       two     A    1.732219
               B    2.065297
dtype: float64

In [149]:
type(stacked)

pandas.core.series.Series

In [150]:
stacked.unstack()

                     A         B
first second
bar   one    -0.343059 -0.425564
      two     1.079171  1.228279
baz   one     0.320055 -1.350161
      two     1.732219  2.065297

In [151]:
stacked.unstack(1)

second        one       two
first
bar   A -0.343059  1.079171
      B -0.425564  1.228279
baz   A  0.320055  1.732219
      B -1.350161  2.065297

## Pivot tables

In [152]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                   'B': ['A', 'B', 'C'] * 4,
                   'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D': np.random.randn(12),
                   'E': np.random.randn(12)})

In [153]:
df

        A  B    C         D         E
0     one  A  foo -0.861054 -0.180703
1     one  B  foo -0.394665  1.285870
2     two  C  foo  0.979602  0.235814
3   three  A  bar  0.740964  0.485782
4     one  B  bar -0.362549  0.463291
5     one  C  bar -0.670296 -0.773450
6     two  A  foo  0.320656  0.117260
7   three  B  foo -1.248733 -0.556987
8     one  C  foo -0.262037 -0.709917
9     one  A  bar -1.205463 -1.060832
10    two  B  bar -0.193923 -0.792012
11  three  C  bar  0.074217 -0.627207

parameter

aggfunc: function to use for aggregation, defaulting to numpy.mean

In [157]:
pd.pivot_table(df, values='D', index=['A', 'B'])

                D
A     B
one   A -1.033259
      B -0.378607
      C -0.466167
three A  0.740964
      B -1.248733
      C  0.074217
two   A  0.320656
      B -0.193923
      C  0.979602

In [159]:
type(pd.pivot_table(df, values='D', index=['A', 'B']))

pandas.core.frame.DataFrame

In [158]:
df.groupby(['A', 'B'])['D'].mean()

A      B
one    A   -1.033259
       B   -0.378607
       C   -0.466167
three  A    0.740964
       B   -1.248733
       C    0.074217
two    A    0.320656
       B   -0.193923
       C    0.979602
Name: D, dtype: float64

In [160]:
type(df.groupby(['A', 'B'])['D'].mean())

pandas.core.series.Series

In [154]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -1.205463 -0.861054
      B -0.362549 -0.394665
      C -0.670296 -0.262037
three A  0.740964       NaN
      B       NaN -1.248733
      C  0.074217       NaN
two   A       NaN  0.320656
      B -0.193923       NaN
      C       NaN  0.979602

In [155]:
pd.pivot_table(df, values=['D', 'E'], index=['A', 'B'], columns=['C'])

                D                   E
C             bar       foo       bar       foo
A     B
one   A -1.205463 -0.861054 -1.060832 -0.180703
      B -0.362549 -0.394665  0.463291  1.285870
      C -0.670296 -0.262037 -0.773450 -0.709917
three A  0.740964       NaN  0.485782       NaN
      B       NaN -1.248733       NaN -0.556987
      C  0.074217       NaN -0.627207       NaN
two   A       NaN  0.320656       NaN  0.117260
      B -0.193923       NaN -0.792012       NaN
      C       NaN  0.979602       NaN  0.235814

## Time series

In [163]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
rng[:10]

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09'],
              dtype='datetime64[ns]', freq='S')

In [164]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts

2012-01-01 00:00:00    109
2012-01-01 00:00:01    331
2012-01-01 00:00:02    460
2012-01-01 00:00:03    436
2012-01-01 00:00:04    457
                      ...
2012-01-01 00:01:35    210
2012-01-01 00:01:36    209
2012-01-01 00:01:37    339
2012-01-01 00:01:38    339
2012-01-01 00:01:39    445
Freq: S, Length: 100, dtype: int64

In [165]:
ts.resample('5Min').sum()

2012-01-01    27267
Freq: 5T, dtype: int64

## Categoricals

In [167]:
df = pd.DataFrame({"id": [1, 2, 3, 4, 5, 6],
                   "raw_grade": ['a', 'b', 'b', 'a', 'a', 'e']})

In [168]:
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [169]:
df["grade"] = df["raw_grade"].astype("category")

In [170]:
df

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [173]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   raw_grade  6 non-null      object
 2   grade      6 non-null      category
dtypes: category(1), int64(1), object(1)
memory usage: 334.0+ bytes

In [174]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [175]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [176]:
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [177]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [178]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

In [179]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

Grouping by a categorical column also shows empty categories.

In [181]:
df.groupby("grade").count()

           id  raw_grade
grade
very bad    1          1
bad         0          0
medium      0          0
good        2          2
very good   3          3

In [182]:
type(df.groupby("grade").count())

pandas.core.frame.DataFrame

In [183]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

In [184]:
type(df.groupby("grade").size())

pandas.core.series.Series